content.org
#+TITLE: CS 421 Web Content
#+HUGO_BASE_DIR: .
#+HUGO_SECTION: lectures

**  Monotype Semantics
:PROPERTIES:
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :type book
:EXPORT_FILE_NAME: monotype-semantics
:END:

This is the first of a two part series on typing semantics.  Semantics can do
more than just discovering the value of a program or expression; we can use
semantics to describe other properties of programs as well.  In this case,
we are interested in the types that expressions can have.

In this lecture we will discuss *monotype* semantics; where expressions can
have only one ground type.

*** Videos

- [[/videos/monotype-semantics][Monotype Semantics]]
- [[https://mediaspace.illinois.edu/media/t/1_vyzrs5s7][Class Session (Spring 2022)]]
#   - title: Class Session (Spring 2021)
#     url: https://mediaspace.illinois.edu/media/t/1_clye3wel
#   - title: Monotype Activity Walkthrough (Fall 2020)
#     url: /videos/monotype-activity


