content/lectures/monotype-semantics.md
+++
title = "Monotype Semantics"
author = ["Mattox Beckman"]
draft = false
type = "book"
+++

This is the first of a two part series on typing semantics.  Semantics can do
more than just discovering the value of a program or expression; we can use
semantics to describe other properties of programs as well.  In this case,
we are interested in the types that expressions can have.

In this lecture we will discuss **monotype** semantics; where expressions can
have only one ground type.


## Videos {#videos}

-   [Monotype Semantics](/videos/monotype-semantics)
-   [Class Session (Spring 2022)](https://mediaspace.illinois.edu/media/t/1_vyzrs5s7)
